# coding=utf-8
'''
author:@带带大师兄
version:114.514
'''
import random
first_name=['王','李','张','刘','陈','杨','黄','周','赵','吴','孙','徐','林','胡','朱','郭','梁','马','高','何','郑','罗','宋','谢','叶','韩','任','潘','唐','于','冯','董','吕','邓','许','曹','曾','袁','程','田','彭','钟','蔡','魏','沈','卢','余','杜','蒋','汪','丁','方','苏','贾','姜','姚','陆','戴','傅','夏','廖','萧','石','范','金','谭','邹','崔','薛','邱','史','江','侯','邵','肖','熊','康','秦','雷','孟','白','毛','阎','郝','钱','段','俞','洪','顾','贺','龚','庞','尹','万','龙','赖','孔','武','邢','颜','汤','章','梅','常','阮','黎','倪','施','乔','樊','严','欧阳','令狐','钟','上官','皇甫']

last_name=['一','丁','七','万','丈','三','上','下','与','世','丘','丙','业','丛','东','丝','两','严','中','丰','临','丹','为','主','丽','举','乃','久','么','义','之','乌','乎','乏','乐','乔','乖','乘','乙','九','习','乡','书','买','予','二','于','云','互','五','亚','交','亥','亦','产','亩','享','京','亭','亮','亲','人','亿','什','仁','今','介','仍','从','仑','仓','仔','仗','付','仙','代','令','以','仪','仰','仲','价','任','份','仿','企','伊','伍','伏','伐','休','众','优','伙','会','伟','传','伦','伯','估','伴','伶','伸','伺','似','佃','但','位','住','佑','体','何','余','作','佩','佳','使','侄','侈','例','侍','供','依','侠','侣','侥','侦','侧','侨','侮','侯','便','促','俄','俊','俏','俐','保','信','俭','修','俯','倍','候','倚','借','倡','值','倾','假','偎','偏','做','停','健','偶','偷','偿','傅','傍','储','催','傲','像','儒','儿','允','元','充','兆','先','光','克','免','兑','兔','党','入','全','八','公','六','兰','共','关','兴','兵','其','具','典','养','兼','冀','内','冈','册','再','冒','冕','军','农','冠','冬','冯','冰','冲','决','况','冷','净','凉','凌','凛','凝','几','凡','凤','凭','凯','凰','卓','单','南','博','卜','占','卡','卢','卫','即','却','卿','厂','历','厉','厘','厚','原','厢','厦','厨','参','又','叉','及','友','双','反','发','叔','取','受','变','叙','叠','古','台','史','右','叶','号','司','各','合','吉','同','名','后','吏','向','吕','君','启','吴','呈','告','员','周','命','和','咏','咨','哲','四','回','因','团','囤','园','固','国','图','圃','土','圣','均','坊','坚','坤','坦','坪','型','城','培','基','堂','堡','堰','塔','墨','士','壮','声','壳','处','备','复','夏','夕','外','多','夜','大','天','太','夫','央','奇','奈','奉','奋','奏','契','奔','奕','奖','奥','女','好','如','妙','子','孔','存','孙','孝','孟','季','学','宁','宅','宇','守','安','宋','宏','宗','官','宙','定','宛','宜','宝','实','宠','审','客','宣','室','宪','宫','宵','家','容','宽','宾','密','富','寒','寓','寝','寞','察','寥','寨','寸','对','寺','寻','导','已','巴','市','布','帅','帆','师','希','帝','带','席','帮','常','帽','幅','幌','幔','幕','幢','干','干','平','年','幸','幻','幽','广','庄','庆','庇','序','庐','库','应','底','店','庙','府','庞','度','座','庭','庵','庶','康','廉','廊','廓','延','廷','建','开','异','弃','弄','弊','式','弓','引','弛','弟','张','弥','弦','弧','弯','弱','弹','强','归','当','录','形','彤','彩','彪','彬','彭','彰','影','役','杈','杉','李','杏','材','村','杖','杜','束','爱','爵','牛','牡','耀','耿','聂','聪','银','锋','锐','锦','锻','镀','镇','镜','长','门','闪','问','闯','闰','间','闺','闻','阁','阅','阎','阐','阔','队','阳','阴','际','陆','陈','陵','陶','隆','随','隐','隔','隘','隙','障','隧','隶','难','雀','雁','雄','雅','集','雇','雌','雏','雕','雨','雪','雳','零','雷','雹','雾','需','震','霉','霍','霎','霜','霞','露','霸','霹','青','靖','静','非','靡','面','革','鞠','韧','韩','音','韵','页','顶','项','顺','顾','颂','颇','颊','频','颖','颜','风','飒','飘','飞','饶','首','香','马','驰','驱','驹','驻','驾','骄','骆','骏','骤','高','鬓','鱼','鲁','鲸','鳄','鸠','鸣','鸥','鸯','鸳','鸿','鹃','鹉','鹊','鹏','鹤','鹰','鹿','麦','麻','黄','默','鼎','鼓','齐','龄','龙']

student=[['姓名',('科目一','科目二','科目三'),'平均分','总分']]

def rd_name():                          #随机生成姓名
    name=random.choice(first_name)
    last=random.randint(1,2)
    for i in range(last):
        name=name+random.choice(last_name)
    return name

def rd_score():                         #随机生成分数
    return random.randint(60,90)

def student_append(name,score1,score2,score3):      #在列表中加入姓名及分数
    student.append([name,(score1,score2,score3)])

def list_sort(std_list,order=True):     #对列表中的元素进行排序
    for i in range(1,len(std_list)):
        for j in range(i,len(std_list)):
            if order:
                if sum(std_list[j][1])>sum(std_list[i][1]):
                    std_list[i],std_list[j]=std_list[j],std_list[i]
            else:
                if sum(std_list[j][1])<sum(std_list[i][1]):
                    std_list[i],std_list[j]=std_list[j],std_list[i]

def avg_sum_append(std_list):           #在列表每个元素后加入平均分及总分
    for i in range(1,len(std_list)):
        std_list[i].append(round(sum(std_list[i][1])/3,2))
        std_list[i].append(round(sum(std_list[i][1]),2))

def class_avg_sum(std_list):            #求全班的平均值
    std_nums=len(std_list)-1
    subject1=0
    subject2=0
    subject3=0
    for i in range(1,len(std_list)):
        subject1+=std_list[i][1][0]
        subject2+=std_list[i][1][1]
        subject3+=std_list[i][1][2]

    subject1=round(subject1/std_nums,2)
    subject2=round(subject2/std_nums,2)
    subject3=round(subject3/std_nums,2)
    std_list.append(['班平均',(subject1,subject2,subject3)])

for i in range(25):
    student_append(rd_name(),rd_score(),rd_score(),rd_score())

for i in range(len(student)):
    print(student[i],end='\n')

print('\n\n')

list_sort(student)                      #先排序然后在最后加入班平均值最后加入平均分及总分
class_avg_sum(student)
avg_sum_append(student)

for i in range(len(student)):
    print(student[i],end='\n')
